data/2023_08_22/read_write_split_disable_7_with_read_pct_80/test-vtgate-run-80-20-125-time-2023-08-22-23-48.txt
run sysbench
check mysql database exists
mysql host 172.16.251.240 connect success!
database mydb exists
/usr/bin/sysbench
cd ./sysbench/src/lua;sysbench --db-driver=mysql --mysql-host=172.16.251.240 --mysql-port=15306 --mysql-user=root --mysql-password=123456 --mysql-db=mydb --table_size=2000000 --tables=50 --time=60 --threads=125 --events=0 --percentile=99 --read-percent=80 --write-percent=20 --skip_trx=on --mysql-ignore-errors=1062 --db-ps-mode=disable --report-interval=1 oltp_read_write_pct run
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 125
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 125 tps: 95.85 qps: 13249.80 (r/w/o: 10806.53/2443.28/0.00) lat (ms,99%): 995.51 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 125 tps: 106.07 qps: 13106.79 (r/w/o: 10641.13/2465.65/0.00) lat (ms,99%): 1069.86 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 125 tps: 84.00 qps: 12559.62 (r/w/o: 10398.51/2161.11/0.00) lat (ms,99%): 1129.24 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 125 tps: 144.93 qps: 13154.99 (r/w/o: 10941.00/2213.99/0.00) lat (ms,99%): 1280.93 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 125 tps: 130.06 qps: 12418.65 (r/w/o: 10107.60/2311.05/0.00) lat (ms,99%): 1109.09 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 125 tps: 143.00 qps: 12631.00 (r/w/o: 9985.00/2646.00/0.00) lat (ms,99%): 1235.62 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 125 tps: 134.00 qps: 12788.01 (r/w/o: 10022.01/2766.00/0.00) lat (ms,99%): 1109.09 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 125 tps: 123.00 qps: 12432.06 (r/w/o: 9784.04/2648.01/0.00) lat (ms,99%): 1170.65 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 125 tps: 123.00 qps: 13175.95 (r/w/o: 10564.96/2610.99/0.00) lat (ms,99%): 1089.30 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 125 tps: 106.00 qps: 12271.97 (r/w/o: 9883.97/2387.99/0.00) lat (ms,99%): 1129.24 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 125 tps: 119.00 qps: 11900.84 (r/w/o: 9797.87/2102.97/0.00) lat (ms,99%): 1191.92 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 125 tps: 110.00 qps: 10671.18 (r/w/o: 8390.14/2281.04/0.00) lat (ms,99%): 1327.91 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 125 tps: 111.00 qps: 11111.00 (r/w/o: 8861.00/2250.00/0.00) lat (ms,99%): 1258.08 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 125 tps: 120.00 qps: 11224.03 (r/w/o: 9137.02/2087.01/0.00) lat (ms,99%): 1327.91 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 125 tps: 116.00 qps: 10721.80 (r/w/o: 8353.84/2367.96/0.00) lat (ms,99%): 1304.21 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 125 tps: 84.00 qps: 11178.16 (r/w/o: 9015.13/2163.03/0.00) lat (ms,99%): 1235.62 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 125 tps: 122.00 qps: 10882.98 (r/w/o: 8740.99/2142.00/0.00) lat (ms,99%): 1427.08 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 125 tps: 122.00 qps: 11540.09 (r/w/o: 9425.07/2115.02/0.00) lat (ms,99%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 125 tps: 127.00 qps: 11058.93 (r/w/o: 8539.94/2518.98/0.00) lat (ms,99%): 1280.93 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 125 tps: 95.00 qps: 12168.98 (r/w/o: 9797.99/2371.00/0.00) lat (ms,99%): 1129.24 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 125 tps: 120.00 qps: 11821.01 (r/w/o: 9368.01/2453.00/0.00) lat (ms,99%): 1235.62 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 125 tps: 110.00 qps: 12152.01 (r/w/o: 9955.01/2197.00/0.00) lat (ms,99%): 1129.24 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 125 tps: 127.00 qps: 11151.96 (r/w/o: 8806.97/2344.99/0.00) lat (ms,99%): 1304.21 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 125 tps: 117.94 qps: 11341.11 (r/w/o: 9027.32/2313.80/0.00) lat (ms,99%): 1213.57 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 125 tps: 110.06 qps: 10704.40 (r/w/o: 8468.27/2236.13/0.00) lat (ms,99%): 1280.93 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 125 tps: 91.00 qps: 10971.10 (r/w/o: 8798.08/2173.02/0.00) lat (ms,99%): 1304.21 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 125 tps: 119.00 qps: 11976.05 (r/w/o: 9953.04/2023.01/0.00) lat (ms,99%): 1327.91 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 125 tps: 122.00 qps: 10212.07 (r/w/o: 7997.05/2215.02/0.00) lat (ms,99%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 125 tps: 96.00 qps: 10683.61 (r/w/o: 8434.69/2248.92/0.00) lat (ms,99%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 125 tps: 84.00 qps: 9403.20 (r/w/o: 7409.16/1994.04/0.00) lat (ms,99%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 125 tps: 147.00 qps: 13353.10 (r/w/o: 10874.09/2479.02/0.00) lat (ms,99%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 125 tps: 111.00 qps: 10734.04 (r/w/o: 8657.03/2077.01/0.00) lat (ms,99%): 1191.92 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 125 tps: 96.00 qps: 8773.03 (r/w/o: 6544.02/2229.01/0.00) lat (ms,99%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 125 tps: 100.00 qps: 12232.74 (r/w/o: 10152.78/2079.96/0.00) lat (ms,99%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 125 tps: 139.00 qps: 12644.18 (r/w/o: 10298.15/2346.03/0.00) lat (ms,99%): 1280.93 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 125 tps: 105.00 qps: 9873.85 (r/w/o: 7495.89/2377.96/0.00) lat (ms,99%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 125 tps: 85.00 qps: 10624.20 (r/w/o: 8657.16/1967.04/0.00) lat (ms,99%): 1304.21 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 125 tps: 124.00 qps: 11629.71 (r/w/o: 9405.77/2223.94/0.00) lat (ms,99%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 125 tps: 125.00 qps: 10359.25 (r/w/o: 8139.20/2220.05/0.00) lat (ms,99%): 1376.60 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 125 tps: 79.00 qps: 10906.04 (r/w/o: 8684.03/2222.01/0.00) lat (ms,99%): 1327.91 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 125 tps: 123.00 qps: 11972.92 (r/w/o: 9858.93/2113.99/0.00) lat (ms,99%): 1401.61 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 125 tps: 123.00 qps: 11056.67 (r/w/o: 8944.74/2111.94/0.00) lat (ms,99%): 1304.21 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 125 tps: 93.00 qps: 9111.98 (r/w/o: 6907.98/2203.99/0.00) lat (ms,99%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 125 tps: 107.00 qps: 11927.43 (r/w/o: 9654.34/2273.08/0.00) lat (ms,99%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 125 tps: 130.00 qps: 12382.57 (r/w/o: 10111.65/2270.92/0.00) lat (ms,99%): 1280.93 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 125 tps: 125.00 qps: 12098.15 (r/w/o: 9551.12/2547.03/0.00) lat (ms,99%): 1170.65 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 125 tps: 117.00 qps: 11698.24 (r/w/o: 9189.19/2509.05/0.00) lat (ms,99%): 1191.92 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 125 tps: 119.00 qps: 11940.75 (r/w/o: 9623.80/2316.95/0.00) lat (ms,99%): 1213.57 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 125 tps: 106.00 qps: 10801.21 (r/w/o: 8624.17/2177.04/0.00) lat (ms,99%): 1280.93 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 125 tps: 118.00 qps: 11312.77 (r/w/o: 9089.82/2222.96/0.00) lat (ms,99%): 1304.21 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 125 tps: 109.00 qps: 11097.22 (r/w/o: 8791.18/2306.05/0.00) lat (ms,99%): 1258.08 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 125 tps: 104.00 qps: 11526.05 (r/w/o: 9350.04/2176.01/0.00) lat (ms,99%): 1258.08 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 125 tps: 120.00 qps: 11434.71 (r/w/o: 9236.76/2197.94/0.00) lat (ms,99%): 1304.21 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 125 tps: 116.00 qps: 10751.82 (r/w/o: 8392.86/2358.96/0.00) lat (ms,99%): 1327.91 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 125 tps: 93.00 qps: 11170.29 (r/w/o: 9077.24/2093.05/0.00) lat (ms,99%): 1235.62 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 125 tps: 117.00 qps: 11002.17 (r/w/o: 8812.13/2190.03/0.00) lat (ms,99%): 1376.60 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 125 tps: 126.00 qps: 11747.84 (r/w/o: 9333.88/2413.97/0.00) lat (ms,99%): 1191.92 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 125 tps: 128.00 qps: 12204.15 (r/w/o: 9682.12/2522.03/0.00) lat (ms,99%): 1129.24 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 125 tps: 120.00 qps: 12623.78 (r/w/o: 10106.82/2516.96/0.00) lat (ms,99%): 1109.09 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 125 tps: 128.00 qps: 12753.18 (r/w/o: 10190.14/2563.04/0.00) lat (ms,99%): 1069.86 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            557680
        write:                           139420
        other:                           0
        total:                           697100
    transactions:                        6971   (115.08 per sec.)
    queries:                             697100 (11508.01 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.5741s
    total number of events:              6971

Latency (ms):
         min:                                  571.29
         avg:                                 1082.52
         max:                                 1535.30
         99th percentile:                     1427.08
         sum:                              7546267.83

Threads fairness:
    events (avg/stddev):           55.7680/0.65
    execution time (avg/stddev):   60.3701/0.19